# Используем официальный образ Golang в качестве базового образа
FROM golang:1.21.4-alpine

# Устанавливаем рабочую директорию внутри контейнера
WORKDIR /app

# Копируем файлы go.mod и go.sum в рабочую директорию
COPY go.mod ./

# Загружаем зависимости
RUN go mod download

# Копируем остальные файлы проекта в рабочую директорию
COPY . .

# Скачиваем зависимости и строим бинарный файл
RUN go build -o main .

# Указываем порт, который будет слушать наше приложение
EXPOSE 8080

# Команда для запуска приложения
CMD ["./main"]
